#### `terraform plan` Success
<details><summary>Show Output</summary>

```

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # acme_certificate.certificate will be created
  + resource "acme_certificate" "certificate" {
      + account_key_pem    = (sensitive value)
      + certificate_domain = (known after apply)
      + certificate_p12    = (sensitive value)
      + certificate_pem    = (known after apply)
      + certificate_url    = (known after apply)
      + common_name        = "*.foreignlanguagereader.com"
      + id                 = (known after apply)
      + issuer_pem         = (known after apply)
      + key_type           = "2048"
      + min_days_remaining = 30
      + must_staple        = false
      + private_key_pem    = (sensitive value)

      + dns_challenge {
          + config   = (sensitive value)
          + provider = "digitalocean"
        }
    }

  # acme_registration.reg will be created
  + resource "acme_registration" "reg" {
      + account_key_pem  = (sensitive value)
      + email_address    = "letsencrypt@lucaskjaerozhang.com"
      + id               = (known after apply)
      + registration_url = (known after apply)
    }

  # tls_private_key.tls_private_key will be created
  + resource "tls_private_key" "tls_private_key" {
      + algorithm                  = "RSA"
      + ecdsa_curve                = "P224"
      + id                         = (known after apply)
      + private_key_pem            = (sensitive value)
      + public_key_fingerprint_md5 = (known after apply)
      + public_key_openssh         = (known after apply)
      + public_key_pem             = (known after apply)
      + rsa_bits                   = 2048
    }

Plan: 3 to add, 0 to change, 0 to destroy.

Warning: Value for undeclared variable

The root module does not declare a variable named "api_secret_key_base" but a
value was found in file "/terraform/terraform.tfvars". To use this value, add
a "variable" block to the configuration.

Using a variables file to set an undeclared variable is deprecated and will
become an error in a future release. If you wish to provide certain "global"
settings to all configurations in your organization, use TF_VAR_...
environment variables to set these instead.

```

</details>

*Workflow: `Test infrastructure plan`, Action: `hashicorpterraform-github-actions4`, Working Directory: `.`, Workspace: `default`*
